; domain
(define (domain depot)
(:requirements :strips :typing)
(:types
    place locatable - object
    depot distributor - place
    truck hoist surface - locatable
    pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action drive
  :parameters (?x - truck ?y - place ?z - place) 
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob4767) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 distributor0)
	(clear crate5)
	(at pallet2 distributor1)
	(clear crate6)
	(at pallet3 distributor0)
	(clear crate1)
	(at pallet4 depot0)
	(clear pallet4)
	(at pallet5 depot0)
	(clear crate7)
	(at truck0 distributor0)
	(at truck1 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet3)
	(at crate1 distributor0)
	(on crate1 crate0)
	(at crate2 depot0)
	(on crate2 pallet5)
	(at crate3 depot0)
	(on crate3 crate2)
	(at crate4 depot0)
	(on crate4 crate3)
	(at crate5 distributor0)
	(on crate5 pallet1)
	(at crate6 distributor1)
	(on crate6 pallet2)
	(at crate7 depot0)
	(on crate7 crate4)
)

(:goal (and
		(on crate0 pallet2)
		(on crate2 pallet0)
		(on crate4 crate7)
		(on crate5 crate4)
		(on crate6 crate0)
		(on crate7 pallet3)
	)
))

; plan
1. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 0 of 6
2. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 0 of 6
3. (lift hoist2 crate6 pallet2 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 pallet2)
   added: (lifting hoist2 crate6) (clear pallet2)
   goals met: 0 of 6
4. (lift hoist0 crate7 crate4 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate4)
   added: (lifting hoist0 crate7) (clear crate4)
   goals met: 0 of 6
5. (load hoist0 crate7 truck1 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck1) (available hoist0)
   goals met: 0 of 6
6. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 0 of 6
7. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 0 of 6
8. (load hoist2 crate6 truck1 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   goals met: 0 of 6
9. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 0 of 6
10. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate3)
   added: (lifting hoist0 crate4) (clear crate3)
   goals met: 0 of 6
11. (lift hoist1 crate5 pallet1 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 pallet1)
   added: (lifting hoist1 crate5) (clear pallet1)
   goals met: 0 of 6
12. (load hoist1 crate5 truck1 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   goals met: 0 of 6
13. (unload hoist1 crate7 truck1 distributor0)
   deleted: (in crate7 truck1) (available hoist1)
   added: (lifting hoist1 crate7)
   goals met: 0 of 6
14. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 0 of 6
15. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   goals met: 0 of 6
16. (drop hoist1 crate7 crate1 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate1)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate1)
   goals met: 0 of 6
17. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 0 of 6
18. (unload hoist1 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   goals met: 0 of 6
19. (drop hoist1 crate4 crate7 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate7)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 crate7)
   goals met: 1 of 6
20. (unload hoist1 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist1)
   added: (lifting hoist1 crate5)
   goals met: 1 of 6
21. (lift hoist0 crate3 crate2 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate2)
   added: (lifting hoist0 crate3) (clear crate2)
   goals met: 1 of 6
22. (drop hoist0 crate3 pallet4 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet4)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet4)
   goals met: 1 of 6
23. (lift hoist0 crate2 pallet5 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 pallet5)
   added: (lifting hoist0 crate2) (clear pallet5)
   goals met: 1 of 6
24. (drop hoist0 crate2 pallet0 depot0)
   deleted: (lifting hoist0 crate2) (clear pallet0)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 pallet0)
   goals met: 2 of 6
25. (drop hoist1 crate5 crate4 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate4)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate4)
   goals met: 3 of 6
26. (unload hoist1 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   goals met: 3 of 6
27. (drop hoist1 crate6 pallet1 distributor0)
   deleted: (lifting hoist1 crate6) (clear pallet1)
   added: (available hoist1) (at crate6 distributor0) (clear crate6) (on crate6 pallet1)
   goals met: 3 of 6
28. (lift hoist1 crate5 crate4 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate4)
   added: (lifting hoist1 crate5) (clear crate4)
   goals met: 2 of 6
29. (drop hoist1 crate5 crate6 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate6)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate6)
   goals met: 2 of 6
30. (lift hoist1 crate4 crate7 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate7)
   added: (lifting hoist1 crate4) (clear crate7)
   goals met: 1 of 6
31. (load hoist1 crate4 truck1 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   goals met: 1 of 6
32. (lift hoist1 crate7 crate1 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate1)
   added: (lifting hoist1 crate7) (clear crate1)
   goals met: 1 of 6
33. (drop hoist1 crate7 crate5 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate5)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate5)
   goals met: 1 of 6
34. (lift hoist1 crate1 crate0 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 crate0)
   added: (lifting hoist1 crate1) (clear crate0)
   goals met: 1 of 6
35. (load hoist1 crate1 truck1 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck1) (available hoist1)
   goals met: 1 of 6
36. (lift hoist1 crate0 pallet3 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet3)
   added: (lifting hoist1 crate0) (clear pallet3)
   goals met: 1 of 6
37. (load hoist1 crate0 truck1 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck1) (available hoist1)
   goals met: 1 of 6
38. (lift hoist1 crate7 crate5 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate5)
   added: (lifting hoist1 crate7) (clear crate5)
   goals met: 1 of 6
39. (drop hoist1 crate7 pallet3 distributor0)
   deleted: (lifting hoist1 crate7) (clear pallet3)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 pallet3)
   goals met: 2 of 6
40. (unload hoist1 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   goals met: 2 of 6
41. (drop hoist1 crate4 crate7 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate7)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 crate7)
   goals met: 3 of 6
42. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 3 of 6
43. (unload hoist2 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist2)
   added: (lifting hoist2 crate0)
   goals met: 3 of 6
44. (drop hoist2 crate0 pallet2 distributor1)
   deleted: (lifting hoist2 crate0) (clear pallet2)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 pallet2)
   goals met: 4 of 6
45. (lift hoist1 crate5 crate6 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate6)
   added: (lifting hoist1 crate5) (clear crate6)
   goals met: 4 of 6
46. (drop hoist1 crate5 crate4 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate4)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate4)
   goals met: 5 of 6
47. (lift hoist1 crate6 pallet1 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 pallet1)
   added: (lifting hoist1 crate6) (clear pallet1)
   goals met: 5 of 6
48. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 5 of 6
49. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   goals met: 5 of 6
50. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 5 of 6
51. (unload hoist2 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist2)
   added: (lifting hoist2 crate6)
   goals met: 5 of 6
52. (drop hoist2 crate6 crate0 distributor1)
   deleted: (lifting hoist2 crate6) (clear crate0)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 crate0)
   goals met: 6 of 6
